app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile", "昔から料理が好きです。\r\n"], ["updated_at", "2020-09-28 10:53:27.517689"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)